Revit 2024 API
TableSectionData.IsValidRowNumber Method
 Verifies if the row number is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsValidRowNumber(
	int nRow
)
Visual Basic
Public Function IsValidRowNumber ( _
	nRow As Integer _
) As Boolean
Visual C++
public:
bool IsValidRowNumber(
	int nRow
)
Parameters
nRow
Type: System.Int32
 The row number.
Return Value
 True if the row number is between FirstRowNumber and LastRowNumber, false otherwise.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace